from operation import X, Summ, Max, Index

txt = {
    'version': 'Программа актуальна для python 3.12 и выше',
    'hi': 'Добро пожаловать в эту программу',
    'list_input': 'Введите значения для списка. Для завершения введите "ьъё"',
    'choosing': 'Что вам приглянулось?'
}

func = {
    '1': {
        'name': 'X\nДелает все элементы в списке равными с введенным элементом.',
        'function': X()
    },
    '2': {
        'name': 'Sum\nНаходит сумму отрицательных чисел.',
        'function': Summ()
    },
    '3': {
        'name': 'Max\nОпределяет максимальный элемент.',
        'function': Max()
    },
    '4': {
        'name': 'Index\nНаходит порядковые номера положительных элементов списка.',
        'function': Index()
    },
}
